{
    "name": "Androsphinx",
    "creature_type": "Monstrosity",
    "alignment": "lawful neutral",
    "size": "Large",
    "hp": 199,
    "ac": 17,
    "srd": true,
    "cr": "17",
    "movement": "40 ft., fly 60 ft.",
    "role": "Artillery",
    "tags": [
        "sphinx",
        "magical beast",
        "guardian"
    ],
    "adjectives": [
        "majestic",
        "enigmatic",
        "wise"
    ],
    "description": "The Androsphinx has the body of a lion and the face of a bearded man, with glowing golden fur and vast, powerful wings. It embodies both a fierce combatant and a formidable spellcaster.",
    "memorable": "Its love of riddles and ability to challenge travelers with cryptic questions make it a unique guardian of ancient knowledge.",
    "goals": "To protect ancient temples and hidden knowledge, often testing those who seek treasure with riddles.",
    "relations": "Often encountered alongside other sphinxes or magical guardians.",
    "environment": "Typically resides in ancient temple ruins or secluded areas guarding forgotten secrets.",
    "strengths": "High magical resilience and the ability to cast a variety of powerful spells, coupled with its magical claw attacks that deal additional force damage.",
    "weaknesses": "Its large size may make it a target, and it can be vulnerable if caught unaware.",
    "attacks": "Utilizes multiattack with claws and magical bolts, dealing significant slashing and force damage.",
    "most_powerful_ability": "Inscrutable; it cannot be affected by mind-reading or emotion-sensing abilities, making it difficult for enemies to gauge its intentions.",
    "senses": "Has truesight up to 120 feet, allowing it to see invisible creatures and objects as well as seeing into the ethereal plane.",
    "skills": "Notably skilled in Arcana and Religion, and possesses high passive Perception for detecting hidden threats.",
    "additional_information": [
        "Possesses resistance to exhaustion and cannot be frightened.",
        "Can unleash a powerful roar that induces fear or deals damage to those who fail their saving throws.",
        "Ability to teleport, adding to its unpredictability in combat.",
        "Induces effects such as paralysis or deafness with its roars.",
        "Can cast spells without needing material components, granting it versatility in combat."
    ],
    "damage_types": [
        "force",
        "thunder"
    ],
    "spellcasting": "The Androsphinx is a 12th-level spellcaster with a variety of powerful spells at its disposal, including healing and control spells.",
    "test_queries": [
        "guardian of ancient riddles",
        "magical creature with lion body",
        "sphinx with powerful roar",
        "enigmatic lion monster",
        "spellcasting lion sphinx"
    ]
}