{
    "name": "Baboon",
    "creature_type": "Beast",
    "alignment": "unaligned",
    "size": "Small",
    "hp": 3,
    "ac": 12,
    "srd": true,
    "cr": "0",
    "movement": "30 ft. walking and climbing speed",
    "role": "null",
    "tags": [
        "agile",
        "opportunistic",
        "social"
    ],
    "adjectives": [
        "small",
        "aggressive",
        "colorful"
    ],
    "description": "The Baboon is a small, agile primate with sharp fangs and a brightly colored face. Known for its aggressive behavior, it lives in large, noisy troops and is often seen chattering and interacting with others. Baboons are skilled climbers, easily navigating trees or rocky terrain.",
    "memorable": "Baboons can overwhelm opponents through sheer numbers, using their agility and Pack Tactics ability in group encounters.",
    "goals": "Baboons are opportunistic scavengers that defend their territory against perceived threats.",
    "relations": "Baboons often travel and fight in packs, relying on each other for support in battles.",
    "environment": "Baboons are commonly found in various environments, typically in the wild.",
    "strengths": "Baboons possess good agility and the ability to coordinate attacks effectively with their allies due to their Pack Tactics.",
    "weaknesses": "Baboons have low hit points and damage output, making them vulnerable to stronger foes.",
    "attacks": "Baboons can execute a Bite attack with low damage, relying on numbers and coordination to increase effectiveness.",
    "most_powerful_ability": "Pack Tactics grants advantage on attack rolls if an ally is nearby, significantly enhancing their combat potential.",
    "equipment": null,
    "senses": "Baboons have darkvision up to 30 feet, allowing them to see in dim light as if it were bright light.",
    "skills": "Baboons demonstrate average perception skills, with a passive Perception score of 11.",
    "additional_information": [
        "Baboons are known for their social nature and aggressive behavior.",
        "They can perform a Startling Display to distract attackers.",
        "Baboons are low-level creatures suitable for new players.",
        "Their Pack Tactics ability can create engaging encounters.",
        "Despite their low overall power, they excel in group scenarios."
    ],
    "damage_types": [],
    "spellcasting": null,
    "test_queries": [
        "colorful primate",
        "aggressive troop animals",
        "small climbing beast",
        "social scavenger",
        "animals using pack tactics"
    ]
}