{
    "name": "Bloated Ghoul",
    "creature_type": "Undead",
    "alignment": "neutral evil",
    "size": "Medium",
    "hp": 142,
    "ac": 14,
    "srd": false,
    "cr": "6",
    "movement": "walk 20 ft.",
    "role": "Bruiser",
    "tags": [
        "undead",
        "ghoul",
        "poisonous",
        "scavenger"
    ],
    "adjectives": [
        "bloated",
        "sinister",
        "durable",
        "resilient"
    ],
    "description": "The Bloated Ghoul is a grotesque undead creature with a swollen, distended stomach, suggesting an insatiable appetite. Its skin is decayed and stretched tight over its robust physique, emanating an unsettling aura.",
    "memorable": "It can consume corpses to regain hit points, emphasizing its role as a scavenger among undead. Its 'Unholy Stench' can poison nearby creatures upon taking damage.",
    "goals": "To feed on the dead and avoid being turned by clerics or paladins.",
    "relations": "Related to traditional ghouls and may be encountered with other undead creatures.",
    "environment": "Typically found in graveyards, battlefields, or places with abundant death.",
    "strengths": "High hit points and solid Constitution give it very good resilience. Immune to poison and resistances to necrotic and slashing damage enhance its survivability.",
    "weaknesses": "Modest Dexterity and Intelligence make it less agile and strategically limited.",
    "attacks": "It employs a Multiattack with a bite that inflicts piercing damage and a claw attack that delivers slashing damage with potential debilitating effects.",
    "most_powerful_ability": "The 'Hideous Feast' allows it to regain significant hit points by consuming corpses, making it increasingly dangerous in prolonged encounters.",
    "senses": "Possesses darkvision up to 60 feet, allowing it to perceive its surroundings even in low-light conditions.",
    "skills": "Noteworthy immunity to poisons and conditions like being charmed or exhausted.",
    "additional_information": [
        "Advantage on saving throws against effects that turn undead due to 'Turning Defiance'.",
        "Releases a noxious vapor that poisons nearby creatures when it is damaged.",
        "Contracts darakhul fever with its bite attack, posing a serious threat to humanoid targets.",
        "Can consume only fresh corpses to regain hit points, reinforcing its scavenger role.",
        "Presence of a bloated stomach suggests an insatiable hunger for flesh."
    ],
    "damage_types": [
        "poison"
    ],
    "spellcasting": null,
    "test_queries": [
        "grotesque undead creature",
        "poisonous ghoul",
        "scavenger undead with high hit points",
        "bloated zombie-like monster",
        "undead that consumes corpses"
    ]
}