{
    "name": "Bouda",
    "creature_type": "Fiend",
    "alignment": "Neutral Evil",
    "size": "Medium",
    "hp": 93,
    "ac": 15,
    "srd": false,
    "cr": "5",
    "movement": "walk 50 ft.",
    "role": "Skirmisher",
    "tags": [
        "fiend",
        "ambusher",
        "shapechanger"
    ],
    "adjectives": [
        "cunning",
        "deceptive",
        "formidable"
    ],
    "description": "A medium-sized fiend with hyena-human hybrid characteristics, showcasing impressive physical attributes.",
    "memorable": "Its ability to change shape and consume the organs of corpses make it a unique and sinister adversary.",
    "goals": "To ambush opponents, manipulate others through deception, and gain strength by consuming corpses.",
    "relations": "Related to other fiends, may serve a higher fiend or operate independently.",
    "environment": "Typically found in dark, desolate areas, often solitary or in small groups.",
    "strengths": "Immunities to fire and poison, high Strength for melee attacks, skilled in stealth and intimidation.",
    "weaknesses": "Vulnerable to magic and silvered weapons, susceptible to specific countermeasures against its abilities.",
    "attacks": "Multiattack with a Bite and Mephitic Claw, causing piercing and poison damage.",
    "most_powerful_ability": "Ravenous Gorge allows it to gain temporary hit points by consuming recent corpses.",
    "equipment": null,
    "senses": "The Bouda can sense magic within 30 feet and detect celestials or consecrated areas by scent within 60 feet.",
    "skills": "Highly skilled in Athletics, Stealth, Deception, and Intimidation, allowing for effective ambush tactics.",
    "additional_information": [
        "Has damage immune to fire and poison",
        "Can change shape between human, hyena, and hybrid forms",
        "Has a lingering stench effect from its Defiling Smear ability",
        "Proficient in ambush tactics",
        "Can gain temporary hit points by consuming corpses"
    ],
    "damage_types": [
        "fire",
        "poison"
    ],
    "spellcasting": null,
    "test_queries": [
        "medium-sized fiend that can change shape",
        "sneaky monster that consumes corpses",
        "ambushing fiend with poison attacks",
        "deceptive creature skilled in stealth",
        "fiend immune to fire and poison"
    ]
}