{
    "name": "Cat",
    "creature_type": "Beast",
    "alignment": "unaligned",
    "size": "Tiny",
    "hp": 2,
    "ac": 12,
    "srd": true,
    "cr": "0",
    "movement": "40 feet walking, 30 feet climbing",
    "role": null,
    "tags": [
        "stealth",
        "companion",
        "tracker"
    ],
    "adjectives": [
        "agile",
        "nimble",
        "clumsy"
    ],
    "description": "The Cat is a small, agile creature known for its grace and stealth. It has sharp claws and a sleek body that allows it to move quietly and jump effectively.",
    "memorable": "Known for its keen senses and ability to climb, the Cat excels in reconnaissance and stealth, making it a useful companion.",
    "goals": "Typically solitary creatures, Cats often hunt small prey like mice and birds, but they can form strong bonds with their companions.",
    "relations": "Often found in homes as companions, they may interact with various small creatures in their environment.",
    "environment": "Common in urban and rural settings, Cats are often seen in homes, as well as around fields or gardens.",
    "strengths": "High Dexterity enables the Cat to move quickly and evade danger effectively.",
    "weaknesses": "Very low hit points and extremely poor physical strength make it vulnerable in combat situations.",
    "attacks": "Attacks with its claws, dealing minimal slashing damage.",
    "most_powerful_ability": "Keen Smell grants it advantage on Perception checks relying on smell, allowing it to track effectively.",
    "equipment": null,
    "senses": "Possesses darkvision up to 30 feet and a passive Perception score of 13.",
    "skills": "Skilled in both Perception and Stealth, enabling it to notice hidden creatures and move quietly.",
    "additional_information": [
        "Can fall 10 feet without taking damage due to its Safe Landing ability.",
        "May charm other creatures with its Charming Mewl ability.",
        "Commonly regarded as clever and independent animals.",
        "Not typically a threat in combat, focusing instead on non-combat roles.",
        "Often found lounging in hidden places."
    ],
    "damage_types": [],
    "spellcasting": null,
    "test_queries": [
        "tiny agile stealthy companion",
        "small creature excellent at tracking",
        "urban cat known for its grace",
        "cat with keen senses and sharp claws",
        "creature that can charm with its meow"
    ]
}