{
    "name": "Chaos Raptor",
    "creature_type": "Monstrosity",
    "alignment": "chaotic neutral",
    "size": "Gargantuan",
    "hp": 248,
    "ac": 18,
    "srd": false,
    "cr": "13",
    "movement": "walk 20 ft., burrow 80 ft., fly 120 ft.",
    "role": "Bruiser",
    "tags": [
        "chaotic",
        "burrowing",
        "flying",
        "regenerative"
    ],
    "adjectives": [
        "gargantuan",
        "chaotic",
        "powerful",
        "agile"
    ],
    "description": "A gargantuan monstrosity capable of causing havoc both in and out of combat. Its notable features include a powerful beak and talons, which it uses to grapple and restrain foes.",
    "memorable": "The Chaos Raptor embodies chaos on the battlefield, influencing the actions of nearby creatures with its Aura of Chaos.",
    "goals": "To create chaos and disruption, leveraging its agility and brute strength in combat.",
    "relations": "Related to other chaotic creatures or monstrosities, possibly serving as a guardian of chaotic locations.",
    "environment": "Typically found in wild or untamed areas where chaos reigns, such as in forests or caves.",
    "strengths": "Its high strength and multiattack capabilities, coupled with the ability to regenerate and burrow, make it a formidable opponent.",
    "weaknesses": "Relies on being submerged to regenerate; thunder damage disrupts its regenerative ability.",
    "attacks": "Can unleash a powerful beak attack and slashing talons that can grapple and restrain foes.",
    "most_powerful_ability": "Aura of Chaos that can disrupt enemy actions and force random movements.",
    "senses": "Possesses tremorsense out to 60 feet, allowing it to sense movements in earth or stone.",
    "skills": "Has advantage on Wisdom (Perception) checks that rely on sight, aiding in detecting threats.",
    "additional_information": [
        "Regeneration only activates when half its mass is buried.",
        "Can move through earth and stone without disturbing it.",
        "Physical attacks are enhanced by extraordinary strength.",
        "Creates unpredictable combat scenarios for opponents.",
        "Can grapple targets to restrict their movement."
    ],
    "damage_types": [],
    "spellcasting": null,
    "test_queries": [
        "gargantuan chaotic creature with powerful attacks",
        "monster that can burrow and fly swiftly",
        "chaos raptor disrupts enemy actions in battles",
        "regenerative creature with strong physical attacks",
        "burrowing creature that creates chaos around it"
    ]
}