{
    "name": "Clockwork Beetle",
    "creature_type": "Construct",
    "alignment": "Unaligned",
    "size": "Tiny",
    "hp": 20,
    "ac": 14,
    "srd": false,
    "cr": "1/2",
    "movement": "walk 50 ft., fly 30 ft.",
    "role": null,
    "tags": [
        "construct",
        "utility",
        "support",
        "flying"
    ],
    "adjectives": [
        "nimble",
        "versatile",
        "mechanical",
        "durable"
    ],
    "description": "A small mechanical insect with intricate clockwork mechanisms and a sturdy exterior, built for utility and support.",
    "memorable": "The Clockwork Beetle can function without air, food, or sleep, making it ideal for harsh environments.",
    "goals": "To assist its creator with tasks and relay information.",
    "relations": "Often created and operated by inventors or artificers.",
    "environment": "Can be found in workshops, tinkers' labs, or anywhere technological marvels are crafted.",
    "strengths": "Highly dexterous, capable of stealth and evasion, with several immunities to damage types and conditions.",
    "weaknesses": "Very low intelligence and charisma limit its mental capabilities and interactions.",
    "attacks": "Bite attack that deals piercing and poison damage, with a DC saving throw for additional poison damage.",
    "most_powerful_ability": "Magic Resistance provides an advantage on saving throws against spells.",
    "equipment": null,
    "senses": "Has darkvision up to 60 feet, allowing it to see in low-light conditions.",
    "skills": "Excels in Stealth, making it adept at hiding from threats.",
    "additional_information": [
        "Immunity to poison and psychic damage",
        "Cannot be affected by spells that alter its form",
        "Can send simple messages to its creator",
        "Functions without the need for air or substance",
        "Good mobility due to flying capabilities"
    ],
    "damage_types": [
        "poison"
    ],
    "spellcasting": null,
    "test_queries": [
        "mechanical insect that assists its creator",
        "tiny magical beetle with flying ability",
        "nimble construct immune to poison damage",
        "versatile tiny factory-made support creature",
        "clockwork bug that bites with poison"
    ]
}