{
    "name": "Cobbleswarm",
    "creature_type": "Beast",
    "alignment": "Unaligned",
    "size": "Medium",
    "hp": 36,
    "ac": 15,
    "srd": false,
    "cr": "2",
    "movement": "30 ft. walking speed",
    "role": "Ambusher",
    "tags": [
        "swarm",
        "beast",
        "ambush"
    ],
    "adjectives": [
        "animated",
        "formidable",
        "tactical"
    ],
    "description": "The Cobbleswarm appears as a pile of normal stones, lying motionless until it strikes with surprising force.",
    "memorable": "Its ability to disguise itself as stones provides a stealthy ambush tactic, posing a unique challenge to adventurers.",
    "goals": "To ambush unsuspecting creatures and disrupt their formations.",
    "relations": "Related to other swarm creatures and could be found alongside rocky terrain fauna.",
    "environment": "Typically found in rocky or stony environments, resembling its surroundings.",
    "strengths": "Its natural camouflage as stones makes it difficult to detect, and it has significant damage resistances.",
    "weaknesses": "Low intelligence limits its tactical options and reliance on brute swarm tactics.",
    "attacks": "Performs melee sting attacks dealing significant piercing damage, particularly dangerous when at full hit points.",
    "most_powerful_ability": "The Shifting Floor ability can force foes to fall prone, greatly impacting their combat effectiveness.",
    "equipment": null,
    "senses": "Has passive perception of 11.",
    "skills": null,
    "additional_information": [
        "Immunity to several conditions, allowing it to function effectively in chaotic combat.",
        "Can execute ambush tactics by blending in with stone environments.",
        "Moves through openings suitable for Tiny stones, enhancing its mobility.",
        "Can push prone enemies away to create space in battle.",
        "Its attacks increase in effectiveness when at full hit points."
    ],
    "damage_types": [
        "none"
    ],
    "spellcasting": null,
    "test_queries": [
        "swarm of animated stones",
        "tactical ambush creature in rocky terrain",
        "medium-sized swarm that looks like rocks",
        "creature that can knock opponents prone",
        "stone monster with significant damage resistances"
    ]
}