{
    "name": "Dawnfly",
    "creature_type": "Beast",
    "alignment": "unaligned",
    "size": "Gargantuan",
    "hp": 261,
    "ac": 21,
    "srd": false,
    "cr": "19",
    "movement": "walk 20 ft., climb 20 ft., fly 90 ft.",
    "role": null,
    "tags": [
        "beast",
        "flying",
        "siege"
    ],
    "adjectives": [
        "gargantuan",
        "chaotic",
        "fierce"
    ],
    "description": "The Dawnfly is a gargantuan beast with immense size and powerful physical attacks, featuring striking wings and a strong presence.",
    "memorable": "Its ability to create a zone of incapacitation and its immunity to cold and fire damage make it a unique and formidable opponent.",
    "goals": "Acts purely on instinct and desire, making it a chaotic force in battle.",
    "relations": "May be encountered with other large beasts or as a solitary predator.",
    "environment": "Typically found in areas where it can dominate both ground and air, such as mountains or vast plains.",
    "strengths": "High Armor Class due to natural armor, significant hit points, and powerful multi-attack capabilities.",
    "weaknesses": "Low Intelligence makes it prone to simple tactics and lack of complex strategy.",
    "attacks": "Utilizes devastating Multiattack with Bite and Tail strikes, including a powerful Wing Slice that stuns.",
    "most_powerful_ability": "The Unsettling Drone incapacitates creatures within 10 feet, adding significant crowd control.",
    "equipment": null,
    "senses": "Possesses blindsight up to 90 feet, enhancing its ability to navigate and attack despite visual impairments.",
    "skills": "Has a passive perception of 12, allowing for basic awareness of its surroundings.",
    "additional_information": [
        "Immunities to cold, fire, and nonmagical damage types.",
        "Ability to double damage to objects and structures as a Siege Monster.",
        "Winged Inferno ignites its wings, dealing area fire damage to nearby creatures.",
        "Can produce a blinding dust to affect creatures in close proximity.",
        "Ability to grapple and drop targets, potentially inflicting fall damage."
    ],
    "damage_types": [
        "cold",
        "fire"
    ],
    "spellcasting": null,
    "test_queries": [
        "gargantuan beast that can fly fast",
        "monster that creates a zone of incapacitation",
        "beast with blinding dust attack",
        "powerful flying creature with flame attacks",
        "large chaotic monster with multiattack capabilities"
    ]
}