{
    "name": "Equitox",
    "creature_type": "Fiend",
    "alignment": "chaotic evil",
    "size": "Large",
    "hp": 178,
    "ac": 15,
    "srd": false,
    "cr": "13",
    "movement": "walk 40 ft.",
    "role": "Bruiser",
    "tags": [
        "fiend",
        "chaotic",
        "necrotic",
        "disease"
    ],
    "adjectives": [
        "formidable",
        "debilitating",
        "malevolent",
        "powerful"
    ],
    "description": "The Equitox is a large fiend with exceptional strength and a menacing presence. It has a Gore attack that combines piercing and necrotic damage, reflecting its chaotic evil nature.",
    "memorable": "Its unique Befouling Aura and Gullylung Fever disease impose crippling effects on its opponents, showcasing its ability to control the battlefield.",
    "goals": "To dominate foes and spread disease, crippling those that dare approach it.",
    "relations": "May command lesser fiends or serve more powerful entities in the infernal hierarchy.",
    "environment": "Typically found in cursed or desolate areas, often where disease or decay is prevalent.",
    "strengths": "Immune to necrotic and poison damage, with resistances to various elemental attacks and nonmagical damage.",
    "weaknesses": "Average Dexterity may limit its mobility compared to faster creatures.",
    "attacks": "Multiattack with two Gore strikes, delivering devastating damage with a mix of piercing and necrotic effects.",
    "most_powerful_ability": "Befouling Aura affects multiple enemies, imposing disadvantage and the threat of debilitating disease.",
    "senses": "Possesses truesight up to 30 feet, allowing it to see through illusions and invisibility.",
    "skills": "Only possesses a +1 bonus to Perception, indicating limited awareness of its surroundings.",
    "additional_information": [
        "Can teleport as a legendary action for exceptional mobility.",
        "Stun ability through Withering Gaze that incapacitates foes temporarily.",
        "Evaporates water in its vicinity, affecting the battlefield.",
        "Regains its strength and abilities based on the destruction it causes.",
        "Inflicts long-term effects through its Gullylung Fever disease."
    ],
    "damage_types": [
        "necrotic",
        "fire"
    ],
    "spellcasting": "Has advantage on saving throws against spells and magical effects.",
    "test_queries": [
        "fiend that spreads disease and necrotic damage",
        "malevolent large creature with a gore attack",
        "beast with debilitating aura and deadly fever",
        "fiend that can evaporate water and teleport",
        "formidable enemy with powerful melee attacks"
    ]
}