{
    "name": "Giant Snow Beetle",
    "creature_type": "Beast",
    "alignment": "unaligned",
    "size": "Large",
    "hp": 45,
    "ac": 12,
    "srd": false,
    "cr": "1",
    "movement": "30 ft. walking speed",
    "role": null,
    "tags": [
        "cold",
        "beast",
        "snow",
        "environment"
    ],
    "adjectives": [
        "large",
        "mobile",
        "strong",
        "stealthy"
    ],
    "description": "The Giant Snow Beetle is a large beetle covered in icy blue and white patterns, capable of rolling sizable snowballs and utilizing its snowy surroundings for camouflage.",
    "memorable": "Its ability to hide even when clearly visible and its poisonous snowball attacks make it a unique threat in cold environments.",
    "goals": "To ambush prey and defend its territory in snowy regions.",
    "relations": "May be encountered alongside other cold-dwelling beasts or in frigid areas.",
    "environment": "Cold environments, often in snowy areas where it can blend in with the landscape.",
    "strengths": "Strong physical attacks combined with stealth capabilities and environmental manipulation.",
    "weaknesses": "Very low intelligence and charisma, making it less effective in social interactions.",
    "attacks": "Pincer attack deals bludgeoning damage, while snowball attacks can cause damage, knockdown effects, and poison.",
    "most_powerful_ability": "Rotten Snowball Shove allows it to poison and damage multiple targets simultaneously.",
    "equipment": null,
    "senses": "Has tremorsense up to 30 feet, enhancing its detection of nearby creatures.",
    "skills": "Proficient in athletics and stealth, making it a formidable ambusher.",
    "additional_information": [
        "Cold damage resistance",
        "Uses snowball concealment for evasion",
        "Can create snowballs for various attacks",
        "Low passive perception",
        "Challenging for lower-level adventurers"
    ],
    "damage_types": [
        "poison"
    ],
    "spellcasting": null,
    "test_queries": [
        "large monster that attacks with snowballs",
        "beetle that can poison and knock down",
        "cold environment ambushing insect",
        "snow camouflage stalking monster",
        "giant beetle with snowball attacks"
    ]
}