{
    "name": "Ophio Fungus",
    "creature_type": "Plant",
    "alignment": "unaligned",
    "size": "Huge",
    "hp": 119,
    "ac": 14,
    "srd": false,
    "cr": "7",
    "movement": "limited to 10 feet walk speed",
    "role": "Controller",
    "tags": [
        "fungus",
        "plant",
        "charming",
        "spores"
    ],
    "adjectives": [
        "huge",
        "powerful",
        "strategic",
        "debilitating"
    ],
    "description": "The Ophio Fungus is a large plant creature with a formidable presence, known for its strategic mind and ability to charm and debilitate foes with its potent spores.",
    "memorable": "Its ability to charm opponents and release damaging spores makes it a complex and challenging adversary.",
    "goals": "To control and debilitate adventurers using its charm and spores.",
    "relations": "May interact with other monsters that thrive in damp or dark environments.",
    "environment": "Usually found in damp, dark areas conducive to fungal growth.",
    "strengths": "Possesses high intelligence and charm capabilities, making it a master of control in combat.",
    "weaknesses": "Vulnerable to fire damage, which can bypass its resistances.",
    "attacks": "Releases harmful spores that inflict poison damage and can infect humanoids.",
    "most_powerful_ability": "Hypnotic Secretion, allowing it to charm foes and manipulate them into viewing it as an ally.",
    "senses": "Blindsight up to 120 feet, enabling it to perceive its surroundings without sight.",
    "skills": null,
    "additional_information": [
        "Can charm creatures effectively for strategic advantages.",
        "Resistant to bludgeoning and piercing damage.",
        "Immunity to poison and psychic damage.",
        "Can target multiple creatures with its spore release.",
        "Does not follow moral guidance, making it unpredictable."
    ],
    "damage_types": [
        "poison"
    ],
    "spellcasting": null,
    "test_queries": [
        "large plant that can charm foes",
        "huge fungus with potent spores",
        "plant monster known for hypnotic abilities",
        "fungal creature that releases damaging spores",
        "unpredictable plant with fire vulnerability"
    ]
}