{
    "name": "Owlbear Recluse",
    "creature_type": "Monstrosity",
    "alignment": null,
    "size": "Large",
    "hp": 119,
    "ac": 13,
    "srd": false,
    "cr": "3",
    "movement": "walk 40 ft., climb 20 ft.",
    "role": "Bruiser",
    "tags": [
        "predator",
        "wild",
        "ambush"
    ],
    "adjectives": [
        "formidable",
        "keen",
        "powerful"
    ],
    "description": "The Owlbear Recluse is a large, bulky creature featuring the formidable combination of an owl and a bear, making it a fearsome opponent in the wild.",
    "memorable": "Its keen senses allow it to detect threats and prey effectively, reinforcing its role as a brutal predator.",
    "goals": "Typically hunts prey in its territory and fiercely defends its lair.",
    "relations": "May be encountered alongside other wild creatures or as a dominant predator in its habitat.",
    "environment": "Commonly found in dense forests and wilderness areas.",
    "strengths": "High Strength enhancing melee attacks and considerable hit points for resilience.",
    "weaknesses": "Low Intelligence and Charisma, making it ineffective in social interactions and with limited tactical capabilities.",
    "attacks": "Utilizes a Multiattack with beak and claws, dealing significant piercing and slashing damage.",
    "most_powerful_ability": "Keen Sight and Smell grants advantage on Perception checks relying on sight or smell.",
    "equipment": null,
    "senses": "Possesses darkvision up to 60 feet, allowing it to navigate in low light.",
    "skills": "Proficient in Perception and Stealth, both with a +3 modifier.",
    "additional_information": [
        "Solid Armor Class of 13 makes it a resilient adversary.",
        "Excels in physical combat due to very good Strength score of 18.",
        "Has a substantial pool of Hit Points at 119.",
        "Limited range of skills which may impact tactical situations.",
        "Mediocre Dexterity resulting in average agility."
    ],
    "damage_types": [],
    "spellcasting": null,
    "test_queries": [
        "large predator with keen senses",
        "ferocious creature in dense forests",
        "wilderness ambush predator",
        "powerful melee attacker with claws",
        "beak and claws melee combatant"
    ]
}