{
    "name": "Pale Screamer",
    "creature_type": "Aberration",
    "alignment": "neutral evil",
    "size": "Medium",
    "hp": 52,
    "ac": 14,
    "srd": false,
    "cr": "3",
    "movement": "swim 30 ft. and walk 30 ft.",
    "role": "Skirmisher",
    "tags": [
        "aberration",
        "medium",
        "neutral evil"
    ],
    "adjectives": [
        "pale",
        "disturbing",
        "tentacled",
        "powerful"
    ],
    "description": "The Pale Screamer is a medium aberration with tentacles and a sinister appearance, able to swim and walk.",
    "memorable": "Known for its paralysis-inducing tentacle attack and powerful deafening scream.",
    "goals": "Typically hunts for prey using ambush tactics and its terrifying scream.",
    "relations": "May be encountered alongside other aberrations or dark entities.",
    "environment": "Found near bodies of water or in dark underground lairs.",
    "strengths": "Resists bludgeoning, cold, and force damage; effective in melee combat.",
    "weaknesses": "Low intelligence and charisma hinder social interactions and cunning strategies.",
    "attacks": "Utilizes a Multiattack with tentacles, dealing bludgeoning damage and potentially paralyzing foes.",
    "most_powerful_ability": "Scream of the Deep can deal thunder damage and deafens opponents in a wide area.",
    "senses": "Has darkvision, allowing effective perception in low-light conditions.",
    "skills": "Proficient in Athletics, showcasing strength in physical challenges.",
    "additional_information": [
        "Can breathe both air and water due to its amphibious nature.",
        "Tentacle attack has an extended reach of 10 feet.",
        "Damage reduction makes it durable against various attacks.",
        "Paralysis effect from its attacks creates dangerous situations in combat.",
        "The creature communicates using Deep Speech."
    ],
    "damage_types": [
        "thunder"
    ],
    "spellcasting": null,
    "test_queries": [
        "creature that screams and paralyzes",
        "aberration with tentacles and strong screams",
        "monster that can breathe water and air",
        "medium monster that uses thunder damage",
        "pale monster found near water"
    ]
}