{
    "name": "Pegasus",
    "creature_type": "Celestial",
    "creature_subtype": "animal",
    "alignment": "chaotic good",
    "size": "Large",
    "hp": 59,
    "ac": 12,
    "srd": true,
    "cr": "2",
    "movement": "60 ft. walking, 90 ft. flying",
    "role": "Skirmisher",
    "tags": [
        "celestial",
        "mount",
        "flying"
    ],
    "adjectives": [
        "majestic",
        "winged",
        "noble",
        "loyal"
    ],
    "description": "A magnificent, winged horse characterized by its grace and beauty, the Pegasus has powerful wings and a large horse-like frame.",
    "memorable": "Pegasus is not only a fast and agile flier but also serves as a loyal mount and protector to its rider.",
    "goals": "To serve virtuous mortals and defend the realms, embodying freedom and purity.",
    "relations": "Often found alongside good-aligned creatures or deities, and may bond with virtuous riders.",
    "environment": "Can be found in celestial realms or in places where good-aligned beings reside.",
    "strengths": "High mobility in the air, resistance to radiant damage, and advantage on saving throws against spells.",
    "weaknesses": "Moderate Armor Class makes it somewhat vulnerable to attacks.",
    "attacks": "Deals substantial bludgeoning damage with its hooves and can knock adversaries prone.",
    "most_powerful_ability": "Diving Pounce allows powerful attacks after flying towards a target.",
    "equipment": null,
    "senses": "Possesses keen perception with a passive score of 17, enabling it to detect hidden foes.",
    "skills": "Skilled in perception, making it reliable for detecting ambushes.",
    "additional_information": [
        "Forms a bond with a rider, enhancing both their effectiveness.",
        "Can catch its rider to prevent dismounting in critical moments.",
        "Has magic weapon attacks that overcome resistances.",
        "Can perform a multiattack with its hooves.",
        "Radiates a Good aura, affecting other creatures' behavior."
    ],
    "damage_types": [
        "radiant"
    ],
    "spellcasting": null,
    "test_queries": [
        "noble winged horse that serves good",
        "fast flying mount with healing aura",
        "majestic creature protects its rider",
        "celestial animal known for loyalty",
        "large horse with powerful wings"
    ]
}