{
    "name": "Planetar",
    "creature_type": "Celestial",
    "creature_subtype": "angel",
    "alignment": "lawful good",
    "size": "Large",
    "hp": 200,
    "ac": 19,
    "srd": true,
    "cr": "16",
    "movement": "40 ft., fly 120 ft.",
    "role": "Bruiser",
    "tags": [
        "celestial",
        "angel",
        "divine",
        "healer",
        "warrior"
    ],
    "adjectives": [
        "powerful",
        "radiant",
        "immortal",
        "formidable",
        "awe-inspiring"
    ],
    "description": "A towering celestial being over 9 feet tall, the Planetar possesses a muscular and radiant body with glowing, ethereal wings. Its presence commands respect and fear, wielding mighty weapons infused with divine energy.",
    "memorable": "The Planetar automatically detects lies and cannot lie itself, making it a reliable ally and a phobia-inducing opponent.",
    "goals": "To carry out the will of its gods by leading armies, smiting evil, or guarding sacred sites.",
    "relations": "Often allied with other celestial beings, including other angels and divine entities.",
    "environment": "Typically found in heavenly realms or near holy sites, engaging in battles against undead or fiends.",
    "strengths": "Exceptionally high stats in strength, wisdom, and charisma; resistance to radiant damage and nonmagical weapon attacks; various powerful spellcasting abilities.",
    "weaknesses": "Relies heavily on spells and melee attacks, making it potentially vulnerable at long range without proper spells ready.",
    "attacks": "The Planetar can use its flaming sword to make two powerful melee attacks, dealing significant slashing and radiant damage, or unleash a devastating line of lightning with a Heavenly Bolt.",
    "most_powerful_ability": "Its innate spellcasting allows it to perform potent spells such as raise dead and control weather without material components.",
    "equipment": null,
    "senses": "Possesses truesight up to 120 feet, enabling it to see through illusions and magical darkness.",
    "skills": "Skilled in perception, athletics, insight, and religion, showcasing its well-rounded abilities.",
    "additional_information": [
        "Angelic weapons deal extra radiant damage on a hit.",
        "Divine protection imposes disadvantage on enemies attacking it.",
        "Magic resistance grants it advantage against spells and magical effects.",
        "Immortal nature allows it to go without food, drink, or sleep.",
        "Champion of Truth ability allows it to detect lies instantly."
    ],
    "damage_types": [
        "radiant"
    ],
    "spellcasting": "The Planetar can cast a variety of spells, including at will spells and others multiple times per day, leveraging its Charisma for spellcasting.",
    "test_queries": [
        "large radiant angel with powerful magic",
        "celestial being that can heal and damage",
        "angelic monster with truesight and spellcasting",
        "formidable divine guardian with flaming sword",
        "Planetar in heavenly battle against fiends"
    ]
}