{
    "name": "Tyrannosaurus Rex",
    "creature_type": "Beast",
    "alignment": "unaligned",
    "size": "Huge",
    "hp": 136,
    "ac": 13,
    "srd": true,
    "cr": "8",
    "movement": "fast 50 feet speed",
    "role": "Bruiser",
    "tags": [
        "dinosaur",
        "predator",
        "ferocious"
    ],
    "adjectives": [
        "colossal",
        "ferocious",
        "massive"
    ],
    "description": "The Tyrannosaurus Rex is a colossal, carnivorous dinosaur known for its massive size, standing over 20 feet tall and weighing several tons. It has powerful jaws lined with sharp teeth capable of crushing bone and massive legs that allow it to charge at surprising speeds.",
    "memorable": "Its ability to grapple and its devastating bite attack make it a uniquely dangerous combatant.",
    "goals": "To dominate its territory and prey on large creatures.",
    "relations": "Often found in the company of other large prehistoric beasts, it may also be a terrifying rival to smaller predators.",
    "environment": "Typically inhabits wild, open areas or jungles where it can hunt effectively.",
    "strengths": "Exceptional physical strength allows it to deal devastating damage, and its Hardy ability mitigates critical damage.",
    "weaknesses": "Low Dexterity makes it vulnerable to more agile foes.",
    "attacks": "Powerful Bite and Tail attacks that deal significant damage.",
    "most_powerful_ability": "Rending Shake, causing additional damage and potential knockdown to grappled foes.",
    "equipment": null,
    "senses": "Passive Perception of 14 indicates it has keen sensing capabilities.",
    "skills": "Has proficiency in Perception skills, allowing it to be aware of its surroundings.",
    "additional_information": [
        "Multiattack allows two attacks against different targets.",
        "Grappling ability restrains targets and grants advantage on bites.",
        "Massive size adds intimidation factor in combat.",
        "Strikes fear into smaller creatures in its territory.",
        "Notable for its ability to charge quickly despite size."
    ],
    "damage_types": [],
    "spellcasting": null,
    "test_queries": [
        "huge dinosaur predator with powerful jaws",
        "fast charging dinosaur that grapples enemies",
        "colossal beast with devastating bite attack",
        "ferocious dinosaur with ability to knock down foes",
        "predatory creature that thrives in open areas"
    ]
}