{
    "name": "Vampiric Vanguard",
    "creature_type": "Undead",
    "alignment": "neutral evil",
    "size": "Medium",
    "hp": 127,
    "ac": 14,
    "srd": false,
    "cr": "7",
    "movement": "walk 40 ft., climb 20 ft.",
    "role": "Skirmisher",
    "tags": [
        "undead",
        "vampire",
        "combat"
    ],
    "adjectives": [
        "formidable",
        "resilient",
        "bloodthirsty"
    ],
    "description": "The Vampiric Vanguard is a lean undead creature embodying vampiric traits, featuring a robust physique and dark, menacing presence.",
    "memorable": "It can heal itself by draining life from its victims and becomes more dangerous when wounded.",
    "goals": "To instill fear in enemies, engage in melee combat, and drain the life force of foes.",
    "relations": "Often found in the service of more powerful vampire lords or allied with other undead entities.",
    "environment": "Commonly encountered in dark places like crypts, ruined castles, or shadowy forests.",
    "strengths": "Exemplary in melee combat with healing capabilities linked to its attacks.",
    "weaknesses": "Vulnerable to sunlight, wooden weapons, and requires invitation to enter a residence.",
    "attacks": "Conducts a multiattack with one Bite and two Claw attacks, draining life and inflicting necrotic damage.",
    "most_powerful_ability": "The Bloodthirsty ability enhances its melee attacks significantly when health is low.",
    "senses": "Possesses darkvision up to 60 feet and a passive perception score of 13.",
    "skills": "Has notable dexterity, making it resilient against physical and necrotic damage.",
    "additional_information": [
        "Heals when inflicting necrotic damage.",
        "Can climb difficult surfaces effortlessly.",
        "Suffers disadvantage on attacks in sunlight.",
        "Restricted entry to places without proper permission.",
        "Destruction condition involves a wooden stake to the heart."
    ],
    "damage_types": [
        "necrotic",
        "radiant"
    ],
    "spellcasting": null,
    "test_queries": [
        "fearsome undead vampire creature",
        "creature that drains life and heals",
        "skilled melee undead with climbing ability",
        "vampire with weaknesses to sunlight and wood",
        "strong undead that attacks and heals simultaneously"
    ]
}