{
    "name": "Yumerai",
    "creature_type": "Fey",
    "alignment": "neutral",
    "size": "Medium",
    "hp": 65,
    "ac": 13,
    "srd": false,
    "cr": "2",
    "movement": "walk 30 ft.",
    "role": "Manipulator",
    "tags": [
        "fey",
        "dream",
        "psychic",
        "stealth"
    ],
    "adjectives": [
        "dream-manipulating",
        "stealthy",
        "trickster"
    ],
    "description": "The Yumerai is a Medium-sized fey creature known for its connection to dreams and psychic abilities, characterized by its charming demeanor and dreamlike presence.",
    "memorable": "The Yumerai can traverse between dreams, controlling the actions of sleeping creatures and inflicting psychic harm.",
    "goals": "To manipulate dreams and control the actions of others, often for playful or tactical purposes.",
    "relations": "Often associated with other fey creatures or beings that govern dreams.",
    "environment": "Typically found in enchanted forests or areas connected to dreams and illusions.",
    "strengths": "High proficiency in stealth and psychic damage, potent dream manipulation abilities.",
    "weaknesses": "Becomes stunned if unable to leap into another dream, limited in physical combat options.",
    "attacks": "Employs psychic lash for mental damage, utilizing deceit and manipulation through spells.",
    "most_powerful_ability": "Dream Leap allows this creature to manipulate dream states and control another's actions.",
    "equipment": null,
    "senses": "Possesses darkvision 60 ft. and a passive perception of 14, aiding in navigating low-light situations.",
    "skills": "Proficient in insight and stealth, allowing for effective manipulation and avoidance.",
    "additional_information": [
        "Resistant to psychic damage",
        "Immune to being rendered unconscious",
        "Innate spellcasting with various utility spells",
        "Can communicate in all languages",
        "Telepathy extending 60 feet"
    ],
    "damage_types": [
        "psychic"
    ],
    "spellcasting": "Innate spellcaster capable of casting spells without components, including control and utility spells.",
    "test_queries": [
        "fey creature that manipulates dreams",
        "psychic trickster with stealth abilities",
        "dream manipulating creature with telepathy",
        "medium fey known for psychic damage",
        "creature that controls sleeping beings"
    ]
}